#1.数学运算符：+(加), -, *, /，//(整除)，%(取余)，**(幂运算)
#和数学中的加 减 乘 除 求余的功能一模一样
a = 20 + 10
print(3%2)
print(2*3.5)
#2.//整除
#求商，商只取整数部分
print(5//2)
print(6.3//2)
#3.**幂运算
# x**y --x的y次方
print(2**3)
print(9**0.5)

#去除一个四位整数的百位上的数
number = 3512
print(number%1000//100)
print(number//100%10)
print(number//1000)
#2.比较运算：>(大于),<(小于),==(等于),!=(不等)，>=(大于等于),<=(小于等于)
#所有的比较运算的结果都是布尔值
print(10 > 20)
print(10 == 10)
print(10 != 20)

#3.逻辑运算符:and(与),or(或),not(非)
#逻辑运算符操作的数据是布尔值 返回的结果也是布尔值
#and(与)-- 和，并且，两个都是True结果才是True,只要有一个是False结果为False
print(True and True)
print(True and False)
#要求绩点3.5以上操评分90以上
score = 4.0
score2 = 80
print(score>3.5 and score2 >=90)
# or(或) --或者
#只要有一个是True结果都是True，两个都是False结果才是False,两个或者多个条件只要一个满足就行
print(score>3.5 or score2 >=90)

# not(非)
# True变成False,False变成True
age = 20
print(not age < 18)
#4.赋值运算符：=(赋值)，+=，-=,*=,/=,%=,//=,**=
#赋值符号的左边必须是变量;运算顺序是先算赋值符号右边的值 然后再将右边的结果赋给左边
# 变量 = 值
a = 10
b = 10 + 90
c = a + b
d = a > 10
#变量 += 值 必须是已经声明过的变量 
a += 10 #相当于a = a + 10(两者不一样，前面地址不会变，后面地址会变)
print(a)  #变量必须先声明再使用
num1 = 10;num2 = 20
num1

# 5.运算符的优先级
#正负 > 数学运算符 > 比较运算符 > 逻辑运算符 > 赋值运算符
#数学运算符中:**>(*,/,%,//)>(+ -)
#优先级高的先计算，如果优先级相同的就从左往右依次计算，可以通过括号改变运算顺序
print(10 * 20 + 30 < 40 / 2 - 100)
print(10 * (20 + 30) < (40 / 2 - 100))
print(2 * 2 ** 3)
print(10/4+23//4*2-30)